## SECTION 1

1.1 If you look at the column Accel you can see that each value has the ' sec' suffix on the value.
This creates an issue becasue if you ever wanted to run a summary function like AVG() on the Accel values you would not be able to becasue the datatype would most likely be a string and not an acceptable type to run that function.
Our Job is to remove that suffix from the Accel column. We are also going to rename the column with the units in the column name to inform the person looking at the table what the column units are.

In [ ]:
1.1 SELECT AccelSec FROM evCars

1.2 We would like to remove ' sec' from each value in the Accel column.

In [ ]:
SELECT Accel, TRIM(accel, ' sec')
FROM evCars

Also take note of how many rows are returned in this select statement. (you can use the rowid on the far left of the result set---> scroll to the bottom number)
You will use this number to confirm you are changing the correct amount of rows in the next step.

In [ ]:
1.3 Use a select statement to visualize the original column and the changes that are made by the string function side by side in the result set.

In [ ]:
SELECT Accel 
FROM evCars;

1.4 Write the update statement to set Accel to equal the return value of the string function that you chose to use in 1.2.

In [ ]:
 UPDATE evCars SET Accel = TRIM(accel, ' sec');

1.5 Write a select statement to look at the column again.

In [ ]:
 SELECT Accel FROM evCars

1.6 Rename the column Accel from accelSec

In [ ]:
ALTER TABLE evCars
	RENAME Accel TO AccelSec

## SECTION 2

2.1 Write a query to look at all the records in the Topspeed column.

In [ ]:
SELECT TopSpeed 
FROM evCars

2.2 We would like to remove 'km/h' from each value in the column TopSpeed.

In [ ]:
 SELECT TopSpeed, TRIM(topspeed, ' km/h')
FROM evCars

2.3 Use a select statement to visualize the original column, TopSpeed and the changes that are made by the string function side by side in the result set.

In [ ]:
SELECT TopSpeed 
FROM evCars
103 rows

2.4 Write the update statement to set TopSpeed to equal the return value of the string function you chose in 2.2

In [ ]:
UPDATE evCars SET TopSpeed = TRIM(topspeed, ' km/h');

2.5 Write a select statement to look at the column again. (you can reuse the code you wrote above in 2.1)

In [ ]:
SELECT TopSpeed 
FROM evCars

2.6 Let's convert the TopSpeed from km/h to MPH
Write a select statement to multiply the speed by 0.621371. Return original Topspeed and calculated TopspeedMPH. Round the answer to 1 decimal place .

In [ ]:
SELECT TopSpeed, ROUND(topspeed * 0.621371,1)
FROM evCars

Write and executing the above query to see the original and the converted value side by side
Turn this query into an UPDATE statement

In [ ]:
UPDATE evCars
SET TopSpeed = ROUND(topspeed * 0.621371,1)

2.7 Rename the TopSpeed column to topSpeedMPH

In [ ]:
ALTER TABLE evCars
RENAME TopSpeed TO TopSpeedMPH

2.8 2.8 Select All of the records to get a look at the whole table with your recent changes.
SELECT *

In [ ]:
SELECT * 
FROM evCars

## SECTION 3

3.1  Review the column that you are looking to change

In [ ]:
 SELECT Range 
FROM evCars

3.2 We would like to remove 'km' from each value in the column Range.

In [ ]:
SELECT Range, TRIM(range, ' km')
FROM evCars

3.3 Use a select statement to visualize the original column, Range and the changes that are made by the string function side by side in the result set.

In [ ]:
UPDATE evCars
SET Range = TRIM(range, ' km');

3.4 Write the update statement to set Range to equal the return value of the string function you chose in 3.2

In [ ]:
UPDATE evCars
SET Range = TRIM(range, ' km');

3.5 Write a select statement to look at the column again. (you can reuse the code you wrote above)

In [ ]:
SELECT range 
FROM evCars

3.6 Let's convert the Range from km to miles.
Write a select statement to multiply the distance by 0.621371. Return original Range and calculated RangeMiles. Round the answer to 1 decimal place.

In [ ]:
SELECT Range, ROUND(range * 0.621371,1)
FROM evCars

In [ ]:
UPDATE evCars 
SET Range = ROUND(range * 0.621371,1)

3.7 Rename the Range column to rangeMiles

In [ ]:
ALTER TABLE evCars 
RENAME Range TO RangeMiles

3.8 Select All of the records to get a look at the whole table with your recent changes.

In [ ]:
SELECT RangeMiles 
FROM evCars

## SECTION 4

4.1 Write a select statement to review both of the columns that you are looking to change

In [ ]:
SELECT Efficiency, FastCharge 
FROM evCars

4.2 We would like to remove ' Wh/km' from each value in the column efficiency.
We would like to remove ' km/h from FastCharge

In [ ]:
SELECT Efficiency, TRIM(efficiency, ' Wh/km')
FROM evCars 


SELECT Efficiency, FastCharge, TRIM(efficiency, ' Wh/km'),TRIM(fastcharge, ' km/h')
FROM evCars

4.3 Use a select statement to visualize the original column efficiency, the string function removing ' Wh/km', original column Fastcharge, and the string function removing ' km/h'

In [ ]:
SELECT Efficiency, FastCharge 
FROM evCars

4.4 Write the update statement to set Range to equal the return value of the string function you chose in 4.2

In [ ]:
UPDATE evCars 
SET Efficiency = TRIM(efficiency, ' Wh/km'), FastCharge = TRIM(fastcharge, ' km/h')

4.5 Write a select statement to look at all of the columns again. (you can reuse the code you wrote above in section4.3)

In [ ]:
SELECT Efficiency, FastCharge 
FROM evCars

4.6 Let's convert the FastCharge from km to miles.
Write a select statement to multiply the distance by 0.621371. Return original FastCharge and calculated OneHourFastChargeMiles. Round the answer to 1 decimal place.
WRITE update query

In [ ]:
SELECT OneHourFastChargeMiles, ROUND(onehourfastchargemiles * 0.621371,1)
FROM evCars

4.7 Write two seperate ALTER TABLE statements for these.
Rename the FastCharge column to OneHourFastChargeMiles
Rename the efficiency column to efficiencyWHperKM

In [ ]:
ALTER TABLE evCars
RENAME Efficiency to efficiencyWHperKM
ALTER TABLE evCars
RENAME FastCharge to OneHourFastChargeMiles

4.8 Select All of the records to get a look at the whole table with your recent changes.

In [ ]:
SELECT *
FROM evCars

## SECTION 5

5.1 Write a query that selects RapidCharge and counts all the records based on that attribute.

In [ ]:
SELECT RapidCharge, Count(*)
from evCars
GROUP BY RapidCharge

5.2 we are going to simplify the records
this can be done in a few different ways
you can make the values a boolean: either True or False
you can make the values a 1 for yes they are rapid charge capable or a 0 for no they are not capable.
or you can do a yes or no.

In [ ]:
UPDATE evCars 
SET RapidCharge = '3'
WHERE RapidCharge is '5'

5.3  For the purpose of this exercise, if the car's `RapidCharge` value equals 3 then I want you to change the value to 'Yes' 
- If the `RapidCharge` value equals 5 then I want you to change the value to 'No'.

## SECTION 6

6.1 Write a query that selects PowerTrain and counts all the records. (HINT: Remember GROUP BY from SQL Lesson 7.2)

In [ ]:
SELECT PowerTrain, Count(*)
FROM evCars 
GROUP BY PowerTrain

6.2 - look at the three DISTINCT values from the query you wrote in 6.1 and fill in the blanks.
- If the PowerTrain equals _____41_________ then I want you to change the value to 'AWD'
- If the PowerTrain equals _______25_____ then I want you to change the value to 'RWD'
- If the PowerTrain equals ______37________ then I want you to change the value to 'FWD

6.3 Write three update statements for the three different conditions

In [ ]:
UPDATE PowerTrain
SET Rear Wheel Drive = '25'
WHERE Count = '22'

UPDATE PowerTrain
SET ALL Wheel Drive = '41'
WHERE Count = '39'

UPDATE PowerTrain
SET Front Wheel Drive = '37'
WHERE Count = '44'

6.4 Write a query to Select all the recods to view all of your changes

In [ ]:
SELECT * 
From evCars

## SECTION 7

7.1 7.1 Convert the PriceEuro to PriceUSD

In [ ]:
SELECT PriceEuro, ROUND(priceeuro  *1.09,2)
FROM evCars

7.2 Turn this query into an UPDATE statement. Remember to round the calculation to two decimal points.
Write a select query from to check the PriceEuro column

In [ ]:
UPDATE evCars
SET PriceEuro=Round(priceeuro *1.09,2)

7.3 Rename PriceEuro to PriceUSD

In [ ]:
 ALTER TABLE evCars
RENAME ROUND(priceeuro * 1.09,2) TO PriceUSD